<?php

return [

    'meeting_type' => [
        'Z10'  => [
            'id'=>'Z10',
            'value'=>'区域会',
        ],
        'Z11'  => [
            'id'=>'Z11',
            'value'=>'全国会',
        ],
        'Z01'  => [
            'id'=>'Z01',
            'value'=>'技术交流会',
        ],
        'Z02'  => [
            'id'=>'Z02',
            'value'=>'用户座谈会',
        ],
        'Z03'  => [
            'id'=>'Z03',
            'value'=>'研讨会',
        ],
        'Z04'  => [
            'id'=>'Z04',
            'value'=>'产品推广会',
        ],
        'Z05'  => [
            'id'=>'Z05',
            'value'=>'经销商会',
        ],
        'Z06'  => [
            'id'=>'Z06',
            'value'=>'销售会议',
        ],
        'Z07'  => [
            'id'=>'Z07',
            'value'=>'公开课',
        ],
        'Z08'  => [
            'id'=>'Z08',
            'value'=>'沙龙',
        ],
        'Z09'  => [
            'id'=>'Z09',
            'value'=>'培训会',
        ],
        'Z99'  => [
            'id'=>'Z99',
            'value'=>'其他',
        ],
    ],

    'consume_type' => [
        'T01' => [
            'id'=>'T01',
            'value'=>'餐饮费',
            'num'=>'0',
            'checked'=>false,
        ],
        'T02' => [
            'id'=>'T02',
            'value'=>'酒店费',
            'num'=>'0',
            'checked'=>false,
        ],
        'T03' => [
            'id'=>'T03',
            'value'=>'酒水外采',
            'num'=>'0',
            'checked'=>false,
        ],
        'T04' => [
            'id'=>'T04',
            'value'=>'机票/火车票',
            'num'=>'0',
            'checked'=>false,
        ],
        'T05' => [
            'id'=>'T05',
            'value'=>'租车',
            'num'=>'0',
            'checked'=>false,
        ],
    ],

    'deposit_person' => [
        'P01' => [
            'id'=>'P01',
            'value'=>'张三',
        ],
        'P02' => [
            'id'=>'P02',
            'value'=>'李四',
        ],
        'P03' => [
            'id'=>'P03',
            'value'=>'王五',
        ],
        'P04' => [
            'id'=>'P04',
            'value'=>'赵六',
        ],
    ],
    'department' => [
        'D01' => [
            'id'=>'D01',
            'value'=>'销售部',
        ],
        'D02' => [
            'id'=>'D02',
            'value'=>'研发部',
        ],
        'D03' => [
            'id'=>'D03',
            'value'=>'人事部',
        ],
    ],
    'meeting' => [
        '1' => 'TONGYI',
        '2' => 'TOP1',
    ],
    'meeting_status' => [
        '9' => [
            'id'=>'9',
            'value'=>'会议草稿',
            'is_main'=>1,
        ],
        '10' => [
            'id'=>'10',
            'value'=>'待审核',
            'is_main'=>1,
        ],
        '11' => [
            'id'=>'11',
            'value'=>'审核失败',//（程序报错）
            'is_main'=>0,
        ],
        '12' => [
            'id'=>'12',
            'value'=>'审核未通过',
            'is_main'=>1,
        ],
        '20' => [
            'id'=>'20',
            'value'=>'待发询单',
            'is_main'=>1,
        ],
        '21' => [
            'id'=>'21',
            'value'=>'询单草稿',
            'is_main'=>0,
        ],
        '22' => [
            'id'=>'22',
            'value'=>'询单发送失败',//（程序报错）
            'is_main'=>0,
        ],
        '30' => [
            'id'=>'30',
            'value'=>'待确认场地',
            'is_main'=>1,
        ],
        '31' => [
            'id'=>'31',
            'value'=>'下单失败',
            'is_main'=>0,
        ],
        '40' => [
            'id'=>'40',
            'value'=>'水单待确认',
            'is_main'=>1,
        ],
        '50' => [
            'id'=>'50',
            'value'=>'订单完成',
            'is_main'=>1,
        ],
        '60' => [
            'id'=>'60',
            'value'=>'取消询单',
            'is_main'=>1,
        ],
    ],
    'meeting_main_status' => [
        '1' =>[
            'min'   => 0,
            'max'   => 9,
            'name'  => '会议草稿'
        ],
        '2' =>[
            'min'   => 10,
            'max'   => 19,
            'name'  => '待审核'
        ],
        '3' =>[
            'min'   => 20,
            'max'   => 29,
            'name'  => '待发询单'
        ],
        '4' =>[
            'min'   => 30,
            'max'   => 39,
            'name'  => '待确认场地'
        ],
        '5' =>[
            'min'   => 40,
            'max'   => 49,
            'name'  => '水单待确认'
        ],
        '6' =>[
            'min'   => 50,
            'max'   => 9,
            'name'  => '订单完成'
        ],
    ],
    'place_type' => [
        '0' => '不限',
        '1' => '酒店',
        '4' => '艺术中心/剧院',
        '3' => '餐厅/会所',
        '2' => '会议中心/展览馆/体育馆',
//        '8' => '度假村',
        '5' => '其他',
    ],
    'star' => [
        '5' => '五星',
        '4' => '四星',
        '3' => '三星',
        '2' => '其他',
    ],
    'area' => [
        '1' => '行政区域',
        '2' => '热门商圈',
        '3' => '机场',
        '4' => '火车站',
        '5' => '地铁周边',
    ],

    'equipment_type' => [
        'key95' => [
            'code'      => 'key95',
            'form_code' => '95',
            'name'      => '投影仪',
        ],
        'key96' => [
            'code'      => 'key96',
            'form_code' => '96',
            'name'      => '有线麦克',
        ],
        'key97' => [
            'code'      => 'key97',
            'form_code' => '97',
            'name'      => '无线麦克',
        ],
        'key98' => [
            'code'      => 'key98',
            'form_code' => '98',
            'name'      => '黑板白板',
        ],
        'key99' => [
            'code'      => 'key99',
            'form_code' => '99',
            'name'      => '音箱',
        ],
        'key100' => [
            'code'      => 'key100',
            'form_code' => '100',
            'name'      => '讲台',
        ],
        'key101' => [
            'code'      => 'key101',
            'form_code' => '101',
            'name'      => '引导牌',
        ],
        'key102' => [
            'code'      => 'key102',
            'form_code' => '102',
            'name'      => '桌卡',
        ],
        'key103' => [
            'code'      => 'key103',
            'form_code' => '103',
            'name'      => '签到台',
        ],

        'key104' => [
            'code'      => 'key104',
            'form_code' => '104',
            'name'      => '多方电话系统',
        ],
        'key105' => [
            'code'      => 'key105',
            'form_code' => '105',
            'name'      => '横幅',
        ],
        'key106' => [
            'code'      => 'key106',
            'form_code' => '106',
            'name'      => '茶水',
        ],
        'key107' => [
            'code'      => 'key107',
            'form_code' => '107',
            'name'      => '矿泉水',
        ],
        'key108' => [
            'code'      => 'key108',
            'form_code' => '108',
            'name'      => 'LED',
        ],
    ],
    'food_type' => [
        '1' => '午餐',
        '2' => '茶歇',
        '3' => '晚餐',
    ],
    'dining_type' => [
        '1' => '自助',
        '2' => '中餐',
        '3' => '西餐',
        '4' => '鸡尾酒',
        '5' => '其它',
    ],
    'wine' => [
        //'9' => '饮料',
        //'11' => '其他',
        '6' => '白酒',
        '7' => '啤酒',
        '8' => '葡萄酒',
        '9' => '饮料',
        '10' => '洋酒',
        '11' => '其它',
    ],
    'room_type' => [
        '1' => '普通大床房',
        '2' => '普通双床房',
        '7' => '行政单间',
        '8' => '行政双床',
        '5' => '套房',
        '3' => '特殊客房',
    ],
    'breakfast' => [
        '0' => '不提供早餐',
        '1' => '提供早餐',
    ],
    'table_type' => [
        '1' => '课桌式',
        '2' => '中式宴会',
        '3' => '剧院式',
        '4' => '鸡尾酒',
        '5' => '鱼骨式',
        '6' => '董事会式',
    ],
    'up_name' => [//上会人
        'U01' => [
            'id'=>'U01',
            'value'=>'康薇',
        ],
        'U02' => [
            'id'=>'U02',
            'value'=>'黄本保',
        ],
        'U03' => [
            'id'=>'U03',
            'value'=>'侯瑞',
        ],
        'U04' => [
            'id'=>'U04',
            'value'=>'刘娇',
        ],
    ],
    'order_status' => [
        '0'=>'全部',
        '1'=>'等待收货',
        '2'=>'等待收货',
        '3'=>'已完成',
        '-1'=>'已取消',
        '-2'=>'已取消',
    ],

    'hotel_service' => [
        '1'=>'外币兑换',
        '2'=>'行李寄存',
        '3'=>'洗衣服务',
        '4'=>'商务中心',
        '5'=>'票务服务',
        '6'=>'接机服务',
        '7'=>'公共区域WIFI',
        '8'=>'大巴车位',
        '9'=>'租车服务',
        '10'=>'收费停车',
        '11'=>'自动提款机',
        '12'=>'免费停车',
        '13'=>'免费WIFI',
        '14'=>'会议厅',
        '15'=>'外币兑换服务',
        '16'=>'送餐服务',
        '17'=>'医务室',
        '18'=>'叫车服务',
        '19'=>'邮政服务',
        '20'=>'专职行李员',
        '21'=>'叫醒服务',
        '22'=>'儿童看护',
        '23'=>'礼宾服务',
        '24'=>'干洗',
        '25'=>'熨烫服务',
        '26'=>'办理私人登基入住/退房手续',
        '27'=>'擦鞋服务',
        '28'=>'婚宴服务',
        '29'=>'多国语言工作人员',
        '30'=>'24小时前台服务',
        '31'=>'快速办理入住/退房手续',
        '32'=>'专职门童',
        '33'=>'信用卡结算服务',
        '34'=>'24小时大堂经理',
        '35'=>'旅游票务专柜',
        '36'=>'接站服务',
        '37'=>'管家服务',
        '38'=>'一次性账单结算服务',
    ],
    'meeting_service' => [
        '1'=>'温泉',
        '2'=>'郊外',
        '3'=>'舞台会场',
        '4'=>'园林草坪',
        '5'=>'无柱会场',
        '6'=>'豪华',
        '7'=>'西式装修',
        '8'=>'景区周边',
        '9'=>'免费WIFI',
        '10'=>'水景',
        '11'=>'泳池',
        '12'=>'自然采光',
        '13'=>'中餐厅',
        '14'=>'西餐厅',
        '15'=>'咖啡厅',
        '16'=>'酒吧',
        '17'=>'残疾人客房',
        '18'=>'理发美容中心',
        '19'=>'前台贵重物品保险柜',
        '20'=>'自动提款机',
        '21'=>'大堂吧',
        '22'=>'电梯',
        '23'=>'中央空调',
        '24'=>'吸烟区',
        '25'=>'礼品廊',
        '26'=>'多功能厅',
        '27'=>'无烟楼层',
        '28'=>'行政楼层',
        '29'=>'行政酒廊',
        '30'=>'多媒体演示系统',
        '31'=>'公共区域闭路电视监控',
        '32'=>'收费停车场',
        '33'=>'可有无线上网公共区域',
        '34'=>'免费交通旅游图（可赠送）',
        '35'=>'所有公共及私人场所严禁吸烟',
        '36'=>'大堂免费报纸',
        '37'=>'公共音响系统',
        '38'=>'非经营性客人休息区',
    ],

    'bit_type' => [
        '0' => 'RFQ',
        '1' => 'Auction',
        '3' => '其他'
    ],

    'city' => [
        '1',
        '2',
        '9',
        '22',
    ],
    'baidu_suggest_url' => 'http://api.map.baidu.com/place/v2/suggestion?ak=ohLEV14RG2hiqGP1IKouKnT8&output=json&query=',

    'place_people_num' => [
        '1' => [
            'min' => 1,
            'max' => 50,
        ],
        '2' => [
            'min' => 51,
            'max' => 100,
        ],
        '3' => [
            'min' => 101,
            'max' => 150,
        ],
        '4' => [
            'min' => 151,
            'max' => 300,
        ],
        '5' => [
            'min' => 301,
            'max' => 500,
        ],
        '6' => [
            'min' => 501,
            'max' => 1000,
        ],
        '7' => [
            'min' => 1000,
            'max' => 10000,
        ],
    ],
    'area' => [
        '1' => [
            'min' => 0,
            'max' => 100,
        ],
        '2' => [
            'min' => 101,
            'max' => 200,
        ],
        '3' => [
            'min' => 201,
            'max' => 300,
        ],
        '4' => [
            'min' => 301,
            'max' => 500,
        ],
        '5' => [
            'min' => 501,
            'max' => 1000,
        ],
        '6' => [
            'min' => 1001,
            'max' => 2000,
        ],
        '7' => [
            'min' => 2000,
            'max' => 10000,
        ],
    ],
    'price' => [
        '1' => [
            'min' => 0,
            'max' => 5000,
        ],
        '2' => [
            'min' => 5001,
            'max' => 10000,
        ],
        '3' => [
            'min' => 10001,
            'max' => 20000,
        ],
        '4' => [
            'min' => 20001,
            'max' => 50000,
        ],
        '5' => [
            'min' => 50001,
            'max' => 100000,
        ],
        '6' => [
            'min' => 100001,
            'max' => 200000,
        ],
        '7' => [
            'min' => 200001,
            'max' => 1000000,
        ],
    ],
//商企通信息
    'staff_info' => [
        'entId' => '27839',
        'app_id' => 'huitang',
        'token' => 'HUITANGTEST-POS',
        'version' => 'bypass',
        'key' => 'Z52ajDgwUjWt5FQMc4kbqQ==',
        'sign' => '1FkD93BFMks7pCahnyL4Ag==',
    ],




    'staff_platform' => [
        '10' => '美团',
        '20' => '点评',
    ],
    'staff_status' => [
        '0' => '待创建',
        '10' => '创建',
        '20' => '撤单',
        '30' => '已拒单',
        '40' => '已接单',
        '50' => '已到店',
        '60' => '未到店',
        '70' => '已取消',
        '80' => '失败',
        '90' => '到点申诉',
        '100' => '申诉未到店',
    ],
    'staff_gender' => [
        '0' => '未知',
        '10' => '女士',
        '20' => '先生',
    ],
    'staff_position' => [
        '10' => '大厅',
        '20' => '优先包间',
        '30' => '包间',
    ],
    'staff_payStatus' => [
        '-1' => '非预定金订单',
        '0' => '新建',
        '1' => '待支付',
        '2' => '支付成功',
        '3' => '支付失败',
        '4' => '退款中',
        '5' => '退款成功',
        '6' => '退款失败',
        '7' => '商家收取',
    ],

    'wallet'        => 'http://evepay.eventown.com/',
    'account_id'    => '1000006',
    'account_pass'  => '123456',
    //客房信息
    'services_others' => [
        '1' => '免费报纸 ',
    ],
    'media_technology' => [
        '1' => '有线频道 ',
        '2' => '液晶电视机 ',
        '3' => '国内长途电话 ',
        '4' => '国际长途电话 ',
        '5' => '卫星频道 ',
    ],
    'food_beverages' => [
        '1' => '电热水壶 ',
        '2' => '小冰箱 ',
        '3' => '免费瓶装水 ',
        '4' => '迷你吧 ',
    ],
    'convenient_facilities' => [
        '1' => '多种规格电源插座 ',
        '2' => '中央空调 ',
        '3' => '书桌 ',
        '4' => '沙发 ',
        '5' => '220V电压插座 ',
        '6' => '遮光窗帘 ',
        '7' => '手动窗帘 ',
        '8' => '房内保险箱 ',
        '9' => '房间内高速上网 ',
        '10' => '毯子或被子 ',
        '11' => '备用床具 ',
        '12' => '客房WIFI覆盖免费 ',
        '13' => '闹钟 ',
        '14' => '针线包 ',
        '15' => '电子秤 ',
        '16' => '熨衣设备 ',
    ],
    'outdoors_views' => [
        '1' => '城景 ',
        '2' => '河景 ',
        '3' => '地标景 ',
        '4' => '江景 ',
        '5' => '海景 ',
        '6' => '园景 ',
    ],
    'bathroom' => [
        '1' => '24小时热水 ',
        '2' => '拖鞋 ',
        '3' => '独立淋浴间 ',
        '4' => '吹风机 ',
        '5' => '免费洗漱用品 ',
        '6' => '淋浴 ',
        '7' => '浴衣 ',
        '8' => '浴缸 ',
        '9' => '浴室 ',
    ],


];
